
public class HW9_1_OddEven {

    /******************************************************************************************************************
     *  1.  Создать алгоритм OddEven, который принимает на вход целое число, возвращает “Odd”,
     *  если число нечетное, и “Even”, если число четное. Во всех остальных случаях результат будет “Undefined”.
     *
     *      Test Data:
     *      -345 →  “Odd”
     *      0 →  “Even”
     *      222222 →  “Even”
     *      2147483647 + 1 →  “Undefined”*/
    public String getOddEven(int n) {
        if (n % 2 == 0 || n == 0) {
            return "Even";
        } else if (n % 2 != 0) {
            return "Odd";
        } else {
            return "Undefined";
        }
    }
}

